Hongranl/stm32f103x/MBoard_project/SI/MBoard_project.si4project/Backup/USART_STM32F10x(4407).c
    USART3,
    RTE_PCLK1,

  // PINS
  {
#ifdef MX_USART3_TX_Pin
    &USART3_tx,
#else
    NULL,
#endif
#ifdef MX_USART3_RX_Pin
    &USART3_rx,
#else
    NULL,
#endif
#ifdef MX_USART3_CK_Pin
    &USART3_ck,
#else
    NULL,
#endif
#ifdef MX_USART3_RTS_Pin 
    &USART3_rts,
#else
    NULL,
#endif
#ifdef MX_USART3_CTS_Pin 
    &USART3_cts,
#else
    NULL,
#endif
    MX_USART3_REMAP_DEF,
    MX_USART3_REMAP,
  },

    USART3_IRQn,

#ifdef MX_USART3_TX_DMA_Instance
  &USART3_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_USART3_RX_DMA_Instance
  &USART3_DMA_Rx,
#else
  NULL,
#endif

  &USART3_Info,
  &USART3_TransferInfo
};
#endif

// UART4
#ifdef MX_UART4

// UART4 Run-Time Information
static USART_INFO          UART4_Info = {0};
static USART_TRANSFER_INFO UART4_TransferInfo = {0};

#ifdef MX_UART4_TX_Pin
  static USART_PIN UART4_tx = {MX_UART4_TX_GPIOx,  MX_UART4_TX_GPIO_Pin};
#endif
#ifdef MX_UART4_RX_Pin
  static USART_PIN UART4_rx = {MX_UART4_RX_GPIOx,  MX_UART4_RX_GPIO_Pin};
#endif

#ifdef MX_UART4_TX_DMA_Instance
  static USART_DMA UART4_DMA_Tx = {
    MX_UART4_TX_DMA_Instance,
    MX_UART4_TX_DMA_Number,
    MX_UART4_TX_DMA_Channel,
    MX_UART4_TX_DMA_Priority
  };
#endif
#ifdef MX_UART4_RX_DMA_Instance
  static USART_DMA UART4_DMA_Rx = {
    MX_UART4_RX_DMA_Instance,
    MX_UART4_RX_DMA_Number,
    MX_UART4_RX_DMA_Channel,
    MX_UART4_RX_DMA_Priority
  };
#endif

// UART4 Resources
static const USART_RESOURCES USART4_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
    0,  // RTS Flow Control available
    0,  // CTS Flow Control available
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
    0,  // RTS Line: 0=not available, 1=available
    0,  // CTS Line: 0=not available, 1=available
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0,  // Signal RI change event: \ref ARM_USART_EVENT_RI
  },

    UART4,
    RTE_PCLK1,

  // PINS
  {
#ifdef MX_UART4_TX_Pin
    &UART4_tx,
#else
    NULL,
#endif
#ifdef MX_UART4_RX_Pin
    &UART4_rx,
#else
    NULL,
#endif
    NULL,
    NULL,
    NULL,
    MX_UART4_REMAP_DEF,
    MX_UART4_REMAP,
  },

    UART4_IRQn,

#ifdef MX_UART4_TX_DMA_Instance
  &UART4_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_UART4_RX_DMA_Instance
  &UART4_DMA_Rx,
#else
  NULL,
#endif

  &UART4_Info,
  &UART4_TransferInfo
};
#endif

// UART5
#ifdef MX_UART5

// UART5 Run-Time Information
static USART_INFO          UART5_Info = {0};
static USART_TRANSFER_INFO UART5_TransferInfo = {0};

#ifdef MX_UART5_TX_Pin
  static USART_PIN UART5_tx = {MX_UART5_TX_GPIOx,  MX_UART5_TX_GPIO_Pin};
#endif
#ifdef MX_UART5_RX_Pin
  static USART_PIN UART5_rx = {MX_UART5_RX_GPIOx,  MX_UART5_RX_GPIO_Pin};
#endif

#ifdef MX_UART5_TX_DMA_Instance
  static USART_DMA UART5_DMA_Tx = {
    MX_UART5_TX_DMA_Instance,
    MX_UART5_TX_DMA_Number,
    MX_UART5_TX_DMA_Channel,
    MX_UART5_TX_DMA_Priority
  };
#endif
#ifdef MX_UART5_RX_DMA_Instance
  static USART_DMA UART5_DMA_Rx = {
    MX_UART5_RX_DMA_Instance,
    MX_UART5_RX_DMA_Number,
    MX_UART5_RX_DMA_Channel,
    MX_UART5_RX_DMA_Priority
  };
#endif

// UART5 Resources
static const USART_RESOURCES USART5_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
    0,  // RTS Flow Control available
    0,  // CTS Flow Control available
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
    0,  // RTS Line: 0=not available, 1=available
    0,  // CTS Line: 0=not available, 1=available
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0,  // Signal RI change event: \ref ARM_USART_EVENT_RI
  },

    UART5,
    RTE_PCLK1,

  // PINS
  {
#ifdef MX_UART5_TX_Pin
    &UART5_tx,
#else
    NULL,
#endif
#ifdef MX_UART5_RX_Pin
    &UART5_rx,
#else
    NULL,
#endif
    NULL,
    NULL,
    NULL,
    MX_UART5_REMAP_DEF,
    MX_UART5_REMAP,
  },

    UART5_IRQn,

#ifdef MX_UART5_TX_DMA_Instance
  &UART5_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_UART5_RX_DMA_Instance
  &UART5_DMA_Rx,
#else
  NULL,
#endif

  &UART5_Info,
  &UART5_TransferInfo
};
#endif

// Auxiliary functions
/**
  \fn          void USART_PeripheralReset (const USART_TypeDef *usart)
  \brief       USART Reset
*/
static void USART_PeripheralReset (const USART_TypeDef *usart) {

  if (usart == USART1) { RCC->APB2RSTR |= RCC_APB2RSTR_USART1RST; }
  if (usart == USART2) { RCC->APB1RSTR |= RCC_APB1RSTR_USART2RST; }
#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
  if (usart == USART3) { RCC->APB1RSTR |= RCC_APB1RSTR_USART3RST; }
#endif
#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_XL) || defined(STM32F10X_HD_VL)
  if (usart == UART4)  { RCC->APB1RSTR |= RCC_APB1RSTR_UART4RST;  }
  if (usart == UART5)  { RCC->APB1RSTR |= RCC_APB1RSTR_UART5RST;  }
#endif

  __NOP(); __NOP(); __NOP(); __NOP();

  if (usart == USART1) { RCC->APB2RSTR &= ~RCC_APB2RSTR_USART1RST; }
  if (usart == USART2) { RCC->APB1RSTR &= ~RCC_APB1RSTR_USART2RST; }
#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
  if (usart == USART3) { RCC->APB1RSTR &= ~RCC_APB1RSTR_USART3RST; }
#endif
#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_XL) || defined(STM32F10X_HD_VL)
  if (usart == UART4)  { RCC->APB1RSTR &= ~RCC_APB1RSTR_UART4RST;  }
  if (usart == UART5)  { RCC->APB1RSTR &= ~RCC_APB1RSTR_UART5RST;  }
#endif
}

// Function prototypes
void USART_IRQHandler (const USART_RESOURCES *usart);
#ifdef __USART_DMA_TX
void USART_TX_DMA_Complete(const USART_RESOURCES *usart);
#endif
#ifdef __USART_DMA_RX
void USART_RX_DMA_Complete(const USART_RESOURCES *usart);
#endif
static int32_t USART_Receive (      void            *data,
                                    uint32_t         num,
                              const USART_RESOURCES *usart);

